In [11]:
import pandas as pd
from sqlalchemy import create_engine, MetaData, Table
import psycopg2
from sqlalchemy.ext.declarative import declarative_base
Base = declarative_base()
from sqlalchemy import Column, Integer, String, Float
import psycopg2

In [ ]:
from sqlalchemy import create_engine
import pandas as pd

In [ ]:
guns_2016 = pd

In [18]:
# Create Engine and connection to Database
#database_path = "guns_db"
# connection_string = "postgres:postgres@localhost:5432/guns_db"
# engine = create_engine(f"sqlite:///{connection_string}")
# conn = engine.connect()
connection_string = "postgres:postgres@localhost:5432/guns_db"
engine = create_engine(f'postgresql://{connection_string}')

In [ ]:
clean_mass_shooting_df.to_sql(name='mass_shootings', con=engine, if_exists='append', index=False)

In [19]:
engine.table_names()

<ipython-input-19-d72bc75a6b62>:1: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['2016_gun_violence',
 '2017_gun_violence',
 '2016poverty',
 '2017poverty',
 'totalpopulation']

In [20]:
guns_2016 = pd.read_csv('2016_gun_violence.csv')
guns_2017 = pd.read_csv('2017_gun_violence.csv')
population = pd.read_csv('population_clean.csv')
poverty_2016 = pd.read_csv('poverty_2016_clean.csv')
poverty_2017 = pd.read_csv('poverty_2017_clean.csv')

In [31]:
guns_2016 = guns_2016.reset_index(inplace=False)

In [38]:
guns_2016 = guns_2016.rename(columns={'index': 'id'})

In [42]:
guns_2016.head()

   id          state  n_killed  n_injured
0   0        Alabama       488        761
1   1          Maine        18         37
2   2       Maryland       429        748
3   3  Massachusetts       112        468
4   4       Michigan       385        700

In [43]:
guns_2016.to_sql(name="2016_gun_violence", con=engine, if_exists='append', index=False)

In [44]:
guns_2017 = guns_2016.reset_index(inplace=False)
guns_2017 = guns_2016.rename(columns={'index': 'id'})

In [47]:
guns_2017.head()

   id          state  n_killed  n_injured
0   0        Alabama       488        761
1   1          Maine        18         37
2   2       Maryland       429        748
3   3  Massachusetts       112        468
4   4       Michigan       385        700

In [48]:
guns_2017.to_sql(name="2017_gun_violence", con=engine, if_exists='append', index=False)

In [50]:
population = population.rename(columns={'Unnamed: 0': 'id'})

In [51]:
population.head()

   id  rank         state  population  density_per_sq_mi
0   0     1    California    39461588           254.2929
1   1     2         Texas    28628666           113.8081
2   2     3       Florida    21244317           409.2229
3   3     4      New York    19530351           409.5400
4   4     5  Pennsylvania    12800922           286.1704

In [52]:
population.to_sql(name="totalpopulation", con=engine, if_exists='append', index=False)

In [54]:
poverty_2016 = poverty_2016.reset_index(inplace=False)
poverty_2016 = poverty_2016.rename(columns={'index': 'id'})

In [58]:
poverty_2016 = poverty_2016.drop(['level_0', 'Unnamed: 0'], axis=1)

In [56]:
poverty_2016 = poverty_2016.rename(columns={'Location': 'state'})

In [59]:
poverty_2016.head()

,id,state,White,Black,Hispanic,Asian/Native Hawaiian and Pacific Islander,American Indian/Alaska Native,Multiple Races,Total
0,0,United States,0.100,0.238,0.210,0.120,0.273,0.174,0.141
1,1,Alabama,0.121,0.279,0.319,0.118,0.126,0.251,0.173
2,2,Alaska,0.068,0.000,0.178,0.000,0.274,0.104,0.106
3,3,Arizona,0.110,0.211,0.238,0.136,0.360,0.155,0.165
4,4,Arkansas,0.138,0.288,0.255,0.129,0.263,0.254,0.172

In [60]:
poverty_2016.to_sql(name="2016poverty", con=engine, if_exists='append', index=False)

In [63]:
poverty_2017 = poverty_2017.rename(columns={'Unnamed: 0': 'id', 'Location': 'state'})

In [65]:
poverty_2017.to_sql(name="2017poverty", con=engine, if_exists='append', index=False)